In [1]:
#Ahmad Ghaznawi
#M07_Lab_Study
#Date July 23, 2023

import numpy as np

import pandas as pd

In [2]:
labels = ['a', 'b', 'c']

my_list = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a':10, 'b':20, 'c':30}
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [3]:
pd.Series(my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [4]:
Series = pd.Series(my_list, index=labels)

Series[0]

10

In [5]:
Series['a']

10

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [8]:
rows = ['X','Y','Z']

cols = ['A', 'B', 'C', 'D', 'E']

In [9]:
data = np.round(np.random.randn(3,5),2)

In [10]:
pd.DataFrame(data, rows, cols)

      A     B     C     D     E
X -0.19  0.19 -1.90  1.42  0.02
Y -0.53  0.46 -0.35  0.61  0.29
Z  1.10 -1.29 -1.46 -0.17  2.28

In [11]:
#Indexing and Assignment in Pandas DataFrames
df['A']

NameError: name 'df' is not defined

In [12]:
#Indexing and Assignment in Pandas DataFrames
df = pd.DataFrame(data, rows, cols)
df['A']

X   -0.19
Y   -0.53
Z    1.10
Name: A, dtype: float64

In [13]:
df['E']

X    0.02
Y    0.29
Z    2.28
Name: E, dtype: float64

In [14]:
#displaying only two columns
columnsIWant = ['A', 'E']

df[columnsIWant]

      A     E
X -0.19  0.02
Y -0.53  0.29
Z  1.10  2.28

In [15]:
#displaying only wanted element in a row
df['B']['Z']

-1.29

In [16]:
df['D']['Y']

0.61

In [17]:
#How To Create and Remove Columns in a Pandas DataFrame
df['A + B'] = df['A'] + df['B']

df

      A     B     C     D     E  A + B
X -0.19  0.19 -1.90  1.42  0.02   0.00
Y -0.53  0.46 -0.35  0.61  0.29  -0.07
Z  1.10 -1.29 -1.46 -0.17  2.28  -0.19

In [18]:
df.drop('A + B', axis = 1)

      A     B     C     D     E
X -0.19  0.19 -1.90  1.42  0.02
Y -0.53  0.46 -0.35  0.61  0.29
Z  1.10 -1.29 -1.46 -0.17  2.28

In [19]:
df

      A     B     C     D     E  A + B
X -0.19  0.19 -1.90  1.42  0.02   0.00
Y -0.53  0.46 -0.35  0.61  0.29  -0.07
Z  1.10 -1.29 -1.46 -0.17  2.28  -0.19

In [20]:
df.drop('A + B', axis=1, inplace=True)

In [21]:
df

      A     B     C     D     E
X -0.19  0.19 -1.90  1.42  0.02
Y -0.53  0.46 -0.35  0.61  0.29
Z  1.10 -1.29 -1.46 -0.17  2.28

In [22]:
df.drop('Z')

      A     B     C     D     E
X -0.19  0.19 -1.90  1.42  0.02
Y -0.53  0.46 -0.35  0.61  0.29

In [23]:
#How To Select A Row From A Pandas DataFrame
df.loc['X']

A   -0.19
B    0.19
C   -1.90
D    1.42
E    0.02
Name: X, dtype: float64

In [24]:
df.iloc[0]

A   -0.19
B    0.19
C   -1.90
D    1.42
E    0.02
Name: X, dtype: float64

In [25]:
#How To Determine The Number Of Rows and Columns in a Pandas DataFrame
df.shape

(3, 5)

In [26]:
#Slicing Pandas DataFrames
df[['A', 'B']]

      A     B
X -0.19  0.19
Y -0.53  0.46
Z  1.10 -1.29

In [27]:
df[['A', 'B']].loc[['X', 'Y']]

      A     B
X -0.19  0.19
Y -0.53  0.46

In [28]:
#Conditional Selection Using Pandas DataFrame
df > 0.5

       A      B      C      D      E
X  False  False  False   True  False
Y  False  False  False   True  False
Z   True  False  False  False   True

In [29]:
df[df > 0.5]

     A   B   C     D     E
X  NaN NaN NaN  1.42   NaN
Y  NaN NaN NaN  0.61   NaN
Z  1.1 NaN NaN   NaN  2.28

In [30]:
df['C'] < 1

X    True
Y    True
Z    True
Name: C, dtype: bool

In [31]:
df[df['C'] < 1]

      A     B     C     D     E
X -0.19  0.19 -1.90  1.42  0.02
Y -0.53  0.46 -0.35  0.61  0.29
Z  1.10 -1.29 -1.46 -0.17  2.28

In [32]:
df[(df['C'] > 0) & (df['A']> 0)]

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [33]:
#How To Modify The Index of a Pandas DataFrame
df.reset_index()

  index     A     B     C     D     E
0     X -0.19  0.19 -1.90  1.42  0.02
1     Y -0.53  0.46 -0.35  0.61  0.29
2     Z  1.10 -1.29 -1.46 -0.17  2.28

In [34]:
df.set_index('A')

          B     C     D     E
A
-0.19  0.19 -1.90  1.42  0.02
-0.53  0.46 -0.35  0.61  0.29
 1.10 -1.29 -1.46 -0.17  2.28

In [35]:
#How To Rename Columns in a Pandas DataFrame
df.columns = [1, 2, 3, 4, 5]

df

      1     2     3     4     5
X -0.19  0.19 -1.90  1.42  0.02
Y -0.53  0.46 -0.35  0.61  0.29
Z  1.10 -1.29 -1.46 -0.17  2.28

In [36]:
#The DataFrame We’ll Be Using In This section
Np.nan

NameError: name 'Np' is not defined

In [37]:
df = pd.DataFrame(np.array([[1, 5, 1],[2, np.nan, 2],[np.nan, np.nan, 3]]))

df.columns = ['A', 'B', 'C']

df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [38]:
df.dropna()

     A    B    C
0  1.0  5.0  1.0

In [39]:
df.dropna(axis=1)

     C
0  1.0
1  2.0
2  3.0

In [40]:
df.fillna('?')

     A    B    C
0  1.0  5.0  1.0
1  2.0    ?  2.0
2    ?    ?  3.0

In [41]:
df.fillna(df.mean())

     A    B    C
0  1.0  5.0  1.0
1  2.0  5.0  2.0
2  1.5  5.0  3.0

In [42]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [43]:
#The Pandas groupby Method
df = pd.DataFrame([ ['Google', 'Sam', 200],

                    ['Google', 'Charlie', 120],

                    ['Salesforce','Ralph', 125],

                    ['Salesforce','Emily', 250],

                    ['Adobe','Rosalynn', 150],

                    ['Adobe','Chelsea', 500]])

df.columns = ['Organization', 'Salesperson Name', 'Sales']

df

  Organization Salesperson Name  Sales
0       Google              Sam    200
1       Google          Charlie    120
2   Salesforce            Ralph    125
3   Salesforce            Emily    250
4        Adobe         Rosalynn    150
5        Adobe          Chelsea    500

In [44]:
df.groupby('Organization')

In [45]:
df.groupby('Organization').mean()

              Sales
Organization
Adobe         325.0
Google        160.0
Salesforce    187.5

In [46]:
df.groupby('Organization').sum()

              Sales
Organization
Adobe           650
Google          320
Salesforce      375

In [47]:
df.groupby('Organization').std()

                   Sales
Organization
Adobe         247.487373
Google         56.568542
Salesforce     88.388348

In [48]:
df.groupby('Organization').count()

              Salesperson Name  Sales
Organization
Adobe                        2      2
Google                       2      2
Salesforce                   2      2

In [49]:
df.groupby('Organization').max()

             Salesperson Name  Sales
Organization
Adobe                Rosalynn    500
Google                    Sam    200
Salesforce              Ralph    250

In [50]:
df.groupby('Organization').min()

             Salesperson Name  Sales
Organization
Adobe                 Chelsea    150
Google                Charlie    120
Salesforce              Emily    125

In [51]:
#Using groupby With The describe Method

df.groupby('Organization').describe()

             Sales
             count   mean         std    min     25%    50%     75%    max
Organization
Adobe          2.0  325.0  247.487373  150.0  237.50  325.0  412.50  500.0
Google         2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Salesforce     2.0  187.5   88.388348  125.0  156.25  187.5  218.75  250.0

In [52]:
#The Pandas concat Method
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],

                        'B': ['B0', 'B1', 'B2', 'B3'],

                        'C': ['C0', 'C1', 'C2', 'C3'],

                        'D': ['D0', 'D1', 'D2', 'D3']},

                        index=[0, 1, 2, 3])

In [53]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],

                        'B': ['B4', 'B5', 'B6', 'B7'],

                        'C': ['C4', 'C5', 'C6', 'C7'],

                        'D': ['D4', 'D5', 'D6', 'D7']},

                         index=[4, 5, 6, 7])

In [54]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],

                        'B': ['B8', 'B9', 'B10', 'B11'],

                        'C': ['C8', 'C9', 'C10', 'C11'],

                        'D': ['D8', 'D9', 'D10', 'D11']},

                        index=[8, 9, 10, 11])

In [55]:
str1 = "Hello "

str2 = "World!"

str1 + str2

'Hello World!'

In [56]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [57]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [58]:
#The Pandas merge Method
leftDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                     'A': ['A0', 'A1', 'A2', 'A3'],

                     'B': ['B0', 'B1', 'B2', 'B3']})

In [59]:

rightDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                          'C': ['C0', 'C1', 'C2', 'C3'],

                          'D': ['D0', 'D1', 'D2', 'D3']})

In [60]:
pd.merge(leftDataFrame, rightDataFrame, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [61]:
#The Pandas join Method

leftDataFrame = pd.DataFrame({  'A': ['A0', 'A1', 'A2', 'A3'],

                                'B': ['B0', 'B1', 'B2', 'B3']},

                                index =['K0', 'K1', 'K2', 'K3'])

   

rightDataFrame = pd.DataFrame({ 'C': ['C0', 'C1', 'C2', 'C3'],

                                'D': ['D0', 'D1', 'D2', 'D3']},

                                index = ['K0', 'K1', 'K2', 'K3'])

In [62]:
leftDataFrame.join(rightDataFrame)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [63]:
df = pd.DataFrame({'col1':['A','B','C','D'],

                   'col2':[2,7,3,7],

                   'col3':['fgh','rty','asd','qwe']})

In [64]:
df.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [65]:
df['col2'].unique()

array([2, 7, 3], dtype=int64)

In [66]:
df['col2'].nunique()

3

In [67]:
#How To Count The Occurence of Each Value In A Pandas Series
df['col2'].value_counts()

7    2
2    1
3    1
Name: col2, dtype: int64

In [68]:
#How To Use The Pandas apply Method
def exponentify(x):

    return x**x

In [69]:
df['col2'].apply(exponentify)

0         4
1    823543
2        27
3    823543
Name: col2, dtype: int64

In [70]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [71]:
#How To Sort A Pandas DataFrame
df.sort_values('col2')

  col1  col2 col3
0    A     2  fgh
2    C     3  asd
1    B     7  rty
3    D     7  qwe

In [1]:
#Local Data Input and Output (I/O) in Pandas
import pandas as pd

pd.read_csv('stock_prices.csv')

,Period,Alphabet Inc Price,Amazon.com Inc Price,Facebook Inc Price,Microsoft Corp Price
0,2020-04-06 00:00:00,1167.150000,1970.70,163.000,161.590
1,2020-04-03 00:00:00,1097.880000,1906.59,154.180,153.830
2,2020-04-02 00:00:00,1120.840000,1918.83,158.190,155.260
3,2020-04-01 00:00:00,1105.620000,1907.70,159.600,152.110
4,2020-03-31 00:00:00,1162.810000,1949.72,166.800,157.710
...,...,...,...,...,...
1259,2015-04-09 00:00:00,539.299623,383.54,82.170,41.480
1260,2015-04-08 00:00:00,540.127350,381.20,82.275,41.420
1261,2015-04-07 00:00:00,535.549915,374.41,82.320,41.530
1262,2015-04-06 00:00:00,535.295614,377.04,82.440,41.545
1263,2015-04-02 00:00:00,534.063994,372.25,81.555,40.290

In [2]:
new_data_frame = pd.read_csv('stock_prices.csv')

In [3]:
#How To Export .csv Files Using Pandas
import pandas as pd

import numpy as np

df = pd.DataFrame(np.random.randn(50,3))

In [4]:
df.to_csv('my_new_csv.csv')

In [6]:
new_data_frame.to_csv('my_new_csv.csv', index = False)

In [7]:
#How To Import .json Files Using Pandas
json_data_frame = pd.read_json('stock_prices.json')

In [8]:
#How To Export .json Files Using Pandas
df.to_json('my_new_json.json')

In [9]:
#How To Import .xlsx Files Using Pandas
new_data_frame = pd.read_excel('stock_prices.xlsx')

In [10]:
#How To Export .xlsx Files Using Pandas
df.to_excel('my_new_excel_file.xlsx')